DAUoverset-4.1/tutorials/hollowCylinderWithoutBaseMesh/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          3248;
        startFace       525820;
    }
    outlet
    {
        type            patch;
        nFaces          3248;
        startFace       529068;
    }
    overset2
    {
        type            overset;
        nFaces          2688;
        startFace       532316;
    }
    side
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          6048;
        startFace       535004;
    }
    overset1
    {
        type            overset;
        nFaces          3240;
        startFace       541052;
    }
)

// ************************************************************************* //
